Testing with 1.9.4 again, a fresh deployment with 
```
registry_namespace = "rag-sample-app"
prefix = "rag-lab-06"
create_icr_namespace = false
```

gives:
```
# module.devsecops_ci_toolchain[0].module.pipeline_ci.ibm_cd_tekton_pipeline_property.ci_pipeline_registry_namespace will be created
 2024/07/25 17:37:16 Terraform plan |   + resource "ibm_cd_tekton_pipeline_property" "ci_pipeline_registry_namespace" {
 2024/07/25 17:37:16 Terraform plan |       + href        = (known after apply)
 2024/07/25 17:37:16 Terraform plan |       + id          = (known after apply)
 2024/07/25 17:37:16 Terraform plan |       + locked      = false
 2024/07/25 17:37:16 Terraform plan |       + name        = "registry-namespace"
 2024/07/25 17:37:16 Terraform plan |       + pipeline_id = (known after apply)
 2024/07/25 17:37:16 Terraform plan |       + type        = "text"
 2024/07/25 17:37:16 Terraform plan |       + value       = "rag-sample-app"
 2024/07/25 17:37:16 Terraform plan |     }
```

Can you confirm that this is the intended logic and the prefix is only used in the namespace when `create_icr_namespace = true`.
I would expect that if the prefix is supplied, it should be used across the board.